IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_PSILSS_0_PSILSS_MMRS.xml
<module name="DMASS0_PSILSS_0_PSILSS_MMRS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PSILSS_MMRS_pid" acronym="PSILSS_MMRS_pid" offset="0x0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1732" description="Module ID" range="27 - 16" rwaccess="R"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x23" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="PSILSS_MMRS_config" acronym="PSILSS_MMRS_config" offset="0x4" width="32" description="The Config Register shows configured params.">
		<bitfield id="ENDPOINTS" width="16" begin="15" end="0" resetval="0x22" description="Number of endpoints supported." range="15 - 0" rwaccess="R"/>
	</register>
	<register id="PSILSS_MMRS_event" acronym="PSILSS_MMRS_event" offset="0x10" width="32" description="The Event Register defines the event to produce for a link down event.">
		<bitfield id="EVT" width="16" begin="15" end="0" resetval="0x65535" description="The event to produce." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="PSILSS_MMRS_link" acronym="PSILSS_MMRS_link" offset="0x20" width="32" description="The Link Register shows the current status of the endpoint links.">
		<bitfield id="STATUS" width="32" begin="31" end="0" resetval="0x0" description="The status of the endpoint links." range="31 - 0" rwaccess="R"/>
	</register>
	<register id="PSILSS_MMRS_down" acronym="PSILSS_MMRS_down" offset="0x40" width="32" description="The Link Down Register shows which links are down for the endpoints.">
		<bitfield id="STATUS" width="32" begin="31" end="0" resetval="0x0" description="The down status of the endpoint links." range="31 - 0" rwaccess="R/W1TC"/>
	</register>
</module>